Tekla.Structures.Model.PhaseCollection
The PhaseCollection class handles the collection of the model phases.
The following example gets the phases of the model and shows the values of the PhaseName and
PhaseNumber properties in a message dialog:
using Tekla.Structures.Model;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Model CurrentModel = new Model();
PhaseCollection PhaseCollection = CurrentModel.GetPhases();
if (CurrentModel.GetConnectionStatus())
{
foreach(Phase p in PhaseCollection)
{
MessageBox.Show("Name = " + p.PhaseName + ", number = " + p.PhaseNumber);
}
}
}
}

Tekla.Structures.Model.PhaseCollection._Phases
Contains all the Phases of the model

Tekla.Structures.Model.PhaseCollection.#ctor
Creates a new phase collection.

Tekla.Structures.Model.PhaseCollection.GetPhases
Get current Phases.

Tekla.Structures.Model.PhaseCollection.CopyTo(System.Array,System.Int32)
Copies the elements of the  to
an , starting at a particular  index.
Array:
The one-dimensional  that is the destination of the elements copied from
the . The  must have zero-based indexing.
Index: The zero-based index in the array at which copying begins.
Throws System.ArgumentNullException: Thrown when the array is null.
Throws System.ArgumentOutOfRangeException: Thrown when the index is less than zero.
Throws System.ArgumentException:
Thrown when the array is multidimensional, or the index is equal to or greater than the length of the array, or the number of elements
in the source  is greater than the available space from the index to
the end of the destination array.
Throws System.InvalidCastException:
Thrown when the type of the source  cannot be cast automatically to the type of
the destination array.
2

Tekla.Structures.Model.PhaseCollection.Count
Gets the number of elements contained in the .
2

Tekla.Structures.Model.PhaseCollection.IsSynchronized
Gets a value indicating whether access to the  is synchronized (thread safe).
2

Tekla.Structures.Model.PhaseCollection.SyncRoot
Gets an object that can be used to synchronize access to the .
2

Tekla.Structures.Model.PhaseCollection.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An  object that can be used to iterate through the collection.
2